const defaultDataset = [
            { vehNo: "SP JG - 2396", transferDate: "2026-06-15", vehType: "මෝටර් සයිකල්", ownerDetails: "ලද්දු කෞෂාල් ලසන්ත ද සිල්වා, මිහිර, බෝයගොඩ පාර, තොල්වත්ත.", rec1: "V/25 938623", amt1: "450.00", rec2: "J 793283", amt2: "700.00" },
            { vehNo: "SP BIT - 5424", transferDate: "2026-06-15", vehType: "මෝටර් සයිකල්", ownerDetails: "වවිලාගල ලියනගේ දෙව්මි සෙව්වන්දි, 366 නවාගන්නාකොලවත්ත, කලුපේ, හික්කඩුව", rec1: "L/25 –938614", amt1: "450.00", rec2: "J 793279", amt2: "700.00" },
            { vehNo: "SP BAE- 3337", transferDate: "2026-06-18", vehType: "මෝටර් සයිකල්", ownerDetails: "රන්නුළු පුෂ්පකුමාර දයාවංශ ද සොයිසා, සෙත්සෙවන, අකුරල, කහව.", rec1: "V/25 938604", amt1: "1450.00", rec2: "J 793272", amt2: "700.00" }
        ];
